{
  "id": "foundations",
  "title": "Future-Ready AI Foundations",
  "track": "foundations",
  "description": "Build a shared language for artificial intelligence aligned with UAE school innovation goals.",
  "checkpoints": {
    "lessons": [
      {
        "id": "intro_ai",
        "title": "AI Around the Emirates",
        "summary": "Discover how the UAE is applying AI across renewable energy, transport, and education initiatives.",
        "durationMins": 15
      },
      {
        "id": "data_literacy",
        "title": "Data Literacy Basics",
        "summary": "Understand datasets, features, and bias using examples from Dubai open data portals.",
        "durationMins": 20
      },
      {
        "id": "ai_ethics",
        "title": "Responsible AI & National Strategy",
        "summary": "Map the UAE's AI ethics guidelines to school innovation projects.",
        "durationMins": 15
      }
    ],
    "practice": {
      "brief": "Review a student pitch for an AI-powered recycling assistant and suggest improvements.",
      "missingPieces": [
        "A clear description of the data sources",
        "Consideration for inclusive design",
        "Metrics for measuring success"
      ],
      "hints": [
        "Link recommendations to UAE Net Zero 2050 priorities.",
        "Check if the proposed data respects the school's privacy policies."
      ],
      "rubricSummary": "Feedback addresses ethics, feasibility, and clarity in equal measure."
    },
    "final": {
      "brief": "Draft a one-page concept note for an AI activity that supports Expo City Dubai's learning hubs.",
      "requirements": [
        "Problem statement tied to a UAE sustainability challenge",
        "Outline of a responsible AI approach",
        "Success indicators for students and community"
      ],
      "rubricSummary": "Evaluated on local relevance, responsible design, and learner impact."
    }
  },
  "expectedOutcomes": [
    "Explain how AI supports the UAE Centennial 2071 vision",
    "Identify ethical considerations in student AI projects",
    "Summarize the difference between data, models, and predictions"
  ],
  "difficulty": 1
}
